[ 
  {
    "role": "Web Developer and Designer",
    "organisation": "Community Centre Alliance",
    "startDate": "Apr, 2025",
    "endDate": "Present",
    "experiences": [
      "Overseeing website maintenance, domain transfer/management and DNS configurations for efficient hosting workflows.",
      "Designing new promotional content to strengthen community engagement and reinforce a consistent brand identity."
    ],
    "imageSrc": "history/cca.png"
  },
  {
    "role": "Web Developement and Design Intern",
    "organisation": "Community Centre Alliance, Buckmaster's Cirlce Community Centre, Virginia Park Community Centre",
    "startDate": "Jan, 2025",
    "endDate": "Apr, 2025",
    "experiences": [
      "Developed and launched modern websites across centres, improving UI/UX and reducing development costs by 75%.",
      "Rebranded organizations with new logos and business cards, modernizing public image and cutting design costs by 52%.",
      "Created promotional materials that increased community engagement by 35% and supported program visibility.",
      "Authored a seniors' support manual for New Horizons and provided daily IT support, reducing downtime by 73%."
    ],
    "imageSrc": [
      "history/cca.png",
      "history/bmcc.png",
      "history/vp.png"
    ]
  },
  {
    "role": "MUNStar-1 Student Collaboration Team",
    "organisation": "MUNStar-1 CubeSat",
    "startDate": "Jan, 2024",
    "endDate": "Present",
    "experiences": [
      "Designing and coding critical ADCS logic using PlantUML, supporting system architecture and integration of the satellite’s core control system responsible for orientation and mission stability. Scheduled launch: 2026/2027."
    ],
    "imageSrc": "history/munstar.png"
  },
  {
    "role": "Superstructure & Project Coordination, Lighting Systems & Software",
    "organisation": "MUN Conctrete Toboggan",
    "startDate": "Sept, 2023",
    "endDate": "Present",
    "experiences": [
      "Engineered and integrated Arduino-controlled LED headlights with 3D-printed housing, battery mount/housing, themed prizes, and a ring toss game using CAD.",
      "Developing a team website using Astro, TypeScript, and CSS to highlight competition information and progress updates."
      ],
    "imageSrc": "history/tbogg.png"
  },
  {
    "role": "Tutor",
    "organisation": "St.Kevin's High School",
    "startDate": "Sept, 2022",
    "endDate": "Jun, 2023",
    "experiences": [
      "Tailored course information to individual students to help them fill in their knowledge gaps.",
      "Effectively communicated difficult concepts to students in a productive and patient manner."
    ],
    "imageSrc": "history/skh.png"
  }
]
